cf-src/Documents/ЗаказКлиента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ЗаказКлиента</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.РезервыТоваров</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗаказов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЦен</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоРезерв</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

cf-src/Documents/ЗаказКлиента/Ext/ManagerModule.bsl
#Если Сервер Тогда

Функция СформироватьПечатнуюФорму(СсылкаДокумента) Экспорт

	Если НЕ ЗначениеЗаполнено(СсылкаДокумента) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ДокументОбъект = СсылкаДокумента.ПолучитьОбъект();
	
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.АвтоМасштаб = Истина;
	ТабДок.ВывестиТекст("Заказ клиента", Новый Шрифт("Arial", 12, Истина));
	ТабДок.ВывестиТекст("");
	ТабДок.ВывестиТекст(СтрШаблон("Номер: %1", ДокументОбъект.Номер));
	ТабДок.ВывестиТекст(СтрШаблон("Дата: %1", Формат(ДокументОбъект.Дата, "ДЛФ=Д")));
	ТабДок.ВывестиТекст(СтрШаблон("Клиент: %1", ДокументОбъект.Клиент));
	ТабДок.ВывестиТекст(СтрШаблон("Склад: %1", ДокументОбъект.Склад));
	ТабДок.ВывестиТекст(СтрШаблон("Статус: %1", ДокументОбъект.Статус));
	ТабДок.ВывестиТекст("");
	
	ТабДок.ВывестиТекст("№\tНоменклатура\tКол-во\tЦена\tСумма", Новый Шрифт("Arial", 10, Истина));
	
	НомерСтроки = 0;
	Для каждого СтрокаТовара Из ДокументОбъект.Товары Цикл
		НомерСтроки = НомерСтроки + 1;
		ТабДок.ВывестиТекст(
			СтрШаблон("%1\t%2\t%3\t%4\t%5",
				НомерСтроки,
				СтрокаТовара.Номенклатура,
				Формат(СтрокаТовара.Количество, "ЧГ=15.3"),
				Формат(СтрокаТовара.Цена, "ЧГ=15.2"),
				Формат(СтрокаТовара.Сумма, "ЧГ=15.2")));
	КонецЦикла;
	
	ТабДок.ВывестиТекст("");
	ТабДок.ВывестиТекст(СтрШаблон("Итого: %1", Формат(ДокументОбъект.СуммаДокумента, "ЧГ=15.2")), Новый Шрифт("Arial", 10, Истина));
	
	Возврат ТабДок;

КонецФункции

Функция ПечатьДокумента(СсылкаДокумента) Экспорт
	Возврат СформироватьПечатнуюФорму(СсылкаДокумента);
КонецФункции

#КонецЕсли
